STREAMS_IDS: dict = {'бвт': 'it_09.03.01', 'бст': 'it_09.03.02', 'бфи': 'it_02.03.02', 'бэи': 'it_09.03.03',
                     'биб': 'kiib_10.03.01', 'бмп': 'kiib_01.03.04', 'зрс': 'kiib_10.05.02', 'бап': 'kiib_15.03.04', 'бут': 'kiib_27.03.04',
                     'брт': 'rit_11.03.01', 'бик': 'rit_11.03.02',
                     'бин': 'siss_11.03.02',
                     'бби': 'tseimk_38.03.05', 'бэр': 'tseimk_42.03.01', 'бээ': 'tseimk_38.03.01'}
STREAMS: list = ['бвт', 'бст', 'бфи', 'биб', 'бэи', 'бик', 'бмп', 'зрс', 'бап', 'бут', 'брт', 'бээ', 'бби', 'бэр', 'бин']
